import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';

@Component({
  selector: 'app-faq',
  templateUrl: './faq.component.html',
  styleUrls: ['./faq.component.scss'],
  imports: [CommonModule]
})
export class FaqComponent {
  activeIndex: number | null = null;

  faqItems = [
    {
      question: '1. Які матеріали ви використовуєте для 3D друку? ',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '2. Яка різниця між FDM та SLA технологіями?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '3. Від чого залежить ціна 3D друку?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '4. Скільки часу займає 3D друк моделі?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '5. Чи можна надрукувати велику модель?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '6. Яку технологію обрати для деталізованих мініатюр?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '7. Чи потрібна підготовка моделі перед друком?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '8. Для яких проєктів підходить FDM друк на 3D принтері Києва?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '9. Чи отримую я кошторис перед початком робіт?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    },
    {
      question: '10. Що робить ваш сервіс унікальним?',
      answer: 'Ми працюємо з різними видами матеріалів для ваших проєктів. PLA пластик відомий своєю доступністю та універсальністю в застосуванні. ABS матеріал забезпечує виняткову міцність виробів при різних навантаженнях. PETG пластик чудово витримує вплив води та підвищеної вологості. Фотополімерні смоли дозволяють створювати моделі з неймовірною деталізацією поверхні. Спеціальні композитні матеріали надають виробам особливі технічні та фізичні властивості.'
    }
  ];

  toggleItem(index: number): void {
    if (this.activeIndex === index) {
      this.activeIndex = null;
    } else {
      this.activeIndex = index;
    }
  }
}
